Revit 2026 API

# AssetPropertyDoubleArray4dSetValueAsDoubles Method

---
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetValueAsDoubles(
	IList<double> value
)
```
```vb
Public Sub SetValueAsDoubles (
	value As IList(Of Double)
)
```
```cpp
public:
void SetValueAsDoubles(
	IList<double>^ value
)
```
```fsharp
member SetValueAsDoubles :
        value : IList<float> -> unit
```

#### Parameters

value IListDouble

#### Reference

AssetPropertyDoubleArray4d Class

Autodesk.Revit.DB.Visual Namespace